Revit 2027 API
ExternallyTaggedGeometryValidation.IsSolid Method
 Makes sure that the input geometry object is a Solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSolid(
	GeometryObject geometry
)
Public Shared Function IsSolid (
	geometry As GeometryObject
) As Boolean
public:
static bool IsSolid(
	GeometryObject^ geometry
)
static member IsSolid :
        geometry : GeometryObject -> bool
Parameters
geometry GeometryObject
 Geometry object to be validated.
Return Value
Boolean
 True if the supplied geometry object is a Solid.
Remarks
 This validation is different than negating IsNonSolid().
See Also
Reference
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace